[
    {
        "id": 1,
        "title": "Climate Check",
        "image": "/Images/WeatherAppLogo.svg",
        "description": [
            "Climate Check is a web based application developed in React offering real-time weather forecasts. ",
            "Climate Check offers a seamless user experience and reliable results. Stay informed about temperature, humidity, wind speed, and more.",
            
            "This applications uses the OpenWeatherMap API to display current weather conditions based on the users search query."
        ],
        "webTechnologies": [
            "HTML",
            "CSS",
            "SCSS",
            "Javascript",
            "Responsive",
            "UI/UX"
        ],
        "repoLink": "www.github.com/goligy08/Outfit"
        

    },
    {
        "id": 2,
        "title": "Outfit",
        "image": "/Images/OutfitBg.png",
        "description": [
            "Outfit is a web application developed in vanilla JavaScript which demonstrates the front-end of a modern, clean, easy to use retail clothing site. Featuring a simple & easy to navigate UI.",
            "This fully functional e-commerce front end aims to replicate many popular e-commerce clothing sites and implements a variety of features including a favourites list as well as fully functional shopping cart & payment screens, complete with form validation.",
             "The UI contains a highly responsive custom built theme, which is adaptive to many major devices."
        ],
        "webTechnologies": [
            "HTML",
            "CSS",
            "SCSS",
            "Javascript",
            "Responsive",
            "UI/UX"
        ],
        "repoLink": "www.github.com/goligy08/Outfit"
        

    },
    {
        "id": 3,
        "title": "Damians' Hairdressing",
        "image": "/Images/DamiansLogo.svg",
        "description": [
            "This single page website demonstrates the tools & features employed on a fully responsive business website. The project aims to exhibit a modern and user friendly User Interface to display business information, news and contact details in a clear and purposeful fashion.",
            "The project is fully responsive to most major desktop, mobiel & tablet devices allowing for an adaptive experience."
        ],
        "webTechnologies": [
            "HTML",
            "CSS",
            "SCSS",
            "Javascript",
            "Responsive",
            "UI/UX"
        ],
        "repoLink": "www.github.com/goligy08/Damians-hairdressing"

    },
    {
    
        "id": 4,
        "title": "Meal Mate",
        "image": "/Images/MealMateLogo.svg",
        "description": [
            "Meal Mate is a React based web application which provides users with recipe suggestions. This application uses 'The MealDB' API in order to display meal recipes based on search term or filtered options.",
            "Users query the API by providing or selecting a main ingredient. Users can also maintain a list of favourite recipes for consideration using the favourite feature without the need for registering an account.",
            "Clicking on a recipe card displays additional information on such as cooking times, ingredient lists and comprehensive cooking instructions."
        ],
        "webTechnologies": [
            "HTML",
            "CSS",
            "SCSS",
            "Javascript",
            "API",
            "Responsive",
            "UI/UX"
            
        ],
        "repoLink": "www.github.com/goligy08/Meal-Mate"
    },
    {
        "id": 5,
        "title": "The Movie DB",
        "image": "/Images/TheMovieDBLogo.svg",
        "description": [
            "The Movie Database is a web based application written in vanilla JavaScript which enables users to search for movies and TV Shows.",
            "This single page web application employs the use of 'TMDB' (The Movie Database) API to populate movies and TV Shows. The user is able to search for content either by entering a search query or by filtering data based on catgeory.",
            "Hovering over each movie entry displays the description. The Movie Database API allows users to locate & explore new movies/genres without the need for an account.",
            "This application could be further enhanced to incorporate user accounts to allow users to store favourites & rate movies."
        ],
        "webTechnologies": [
            "HTML",
            "CSS",
            "SCSS",
            "Javascript",
            "API",
            "Responsive",
            "UI/UX"
        ],
        "repoLink": "www.github.com/goligy08/TheMovieDB"
    },
    {
    
        "id": 6,
        "title": "Todo List App",
        "image": "/Images/TodoListLogo.svg",
        "description": [
            "Task Master is a web application developed in React which allows users to stay organized and boost productivity with ease; ",
            "Create, prioritize, and track tasks effortlessly.",
            "Users can create & store todo items and mark each item as complete when needed."
           
        ],
        "webTechnologies": [
            "HTML",
            "CSS",
            "SCSS",
            "Javascript",
            "API",
            "Responsive",
            "UI/UX"
            
        ],
        "repoLink": "www.github.com/goligy08/Meal-Mate"
    }
   
]